/*
Дана сторона квадрата. Найти его периметр.
*/

Console.WriteLine("Введите длину стороны квадрата: ");
double storona = Convert.ToDouble(Console.ReadLine());

Console.Write($"Периметр квадрата равен = {storona*4}");

