/*
Известно значение температуры по шкале Цельсия. 
Найти соответствующее  значение температуры по шкале: 
а) Фаренгейта; 
б) Кельвина.
Для пересчета по шкале Фаренгейта необходимо 
исходное значение температуры умножить на 1,8 
и к результату прибавить 32, 
а по шкале Кельвина абсолютное значение нуля 
соответствует 273,15 градуса по шкале Цельсия.
*/

Console.WriteLine("Введите значение температуры по шкале Цельсия: ");
double tempC = Convert.ToDouble(Console.ReadLine());
double tempF = tempC * 1.8 + 32;
double tempK = tempC + 273.15;

Console.WriteLine($"Значение температуры ппо шкале Фаренгейта = {tempF}");
Console.WriteLine($"Значение температуры ппо шкале Кельвина = {tempK}");