/*
Пассажир должен был сдать в камеру хранения пустой чемодан 
в форме параллелепипеда размерами a1 , a2 и a3 см и
коробку размерами b1 , b2 и b3 см. 
Оплачивать нужно каждый размещаемый предмет. 
Определить, сможет ли пассажир сэкономить на оплате, 
поместив коробку в чемодан так, что стороны чемодана и коробки 
будут параллельны либо перпендикулярны друг другу.
*/


bool DoesBoxFitCase(int a1, int a2, int a3, int b1, int b2, int b3) 
{ 
    if ((a1 > b1) && (a2 > b2) && (a3 > b3)) 
    { 
        return true; 
    } 
    else 
    if ((a1 > b2) && (a2 > b3) && (a3 > b1)) 
    { 
        return true; 
    } 
    else 
    { 
        return false; 
    } 
} 
Console.WriteLine(DoesBoxFitCase(4, 5, 6, 4, 3, 2));



