/*
Напишите программу, которая будет создавать 
копию заданного одномерного массива 
с помощью поэлементного копирования.
*/

// int[] copyArr(int[] arr)
// {
//     int[] copyArray = new int[arr.Length];
//     for (int i = 0; i < arr.Length; i++)
//     {
//         copyArray[i] = arr[i];
//     }
//     return copyArray;
// }
///// Нужно думать 
//void printArr
//Console.WriteLine("Hello, World!");

// ДОМАШКА
/*
Пользователь вводит с клавиатуры M чисел. 
Посчитайте, сколько чисел больше 0 ввёл пользователь.

0, 7, 8, -2, -2 -> 2-1, -7, 567, 89, 223-> 3
*/

/*
Напишите программу, которая найдёт точку пересечения двух прямых, 
заданных уравнениями y = k1 * x + b1, y = k2 * x + b2; 
значения b1, k1, b2 и k2 задаются пользователем.

b1 = 2, k1 = 5, b2 = 4, k2 = 9 -> (-0,5; 5,5)
*/