/*
Задайте значение N. Напишите программу, 
которая выведет все натуральные числа в промежутке от 1 до N.

N = 5 -> "1, 2, 3, 4, 5"
N = 6 -> "1, 2, 3, 4, 5, 6"
*/

// int PrintAToB(int start, int finish)
// {
//     if (finish == start)
//     {
//         System.Console.WriteLine(finish);
//         return finish;
//     }
//     else
//     {
//         System.Console.Write($"{start}, ");
//         return PrintAToB(start + 1, finish);
//     }
// }