/*
Работа светофора для пешеходов запрограммирована следующим образом: 
в начале каждого часа в течение трех минут горит зеленый сигнал,
затем в течение двух минут — красный, в течение трех минут — опять зеленый и т. д. 
Дано вещественное число t, означающее время в минутах, 
прошедшее с начала очередного часа. Определить, 
сигнал какого цвета горит для пешеходов в этот момент.
*/

Console.WriteLine("Enter number of minutes"); 
double minutes = Convert.ToDouble(Console.ReadLine()); 
minutes %= 5;
if (minutes < 3) Console.WriteLine("Green light"); 
else Console.WriteLine("Red light");
